[{
        "title": "MVURA NKUVURE Project",
        "image": "",
        "description": "MVURA NKUVURE Project A five year project (2018-2023) funded by the Netherlands Embassy in Rwanda and implemented in partnership with Duhumurizanye Iwacu Rwanda (DIR); EAR-Byumba Diocese and Prison Fellowship Rwanda to : Address intergenerational legacies<br>of genocide Ensure successful psychosocial reintegration of prisoners Raise awareness and ownership of reconciliation processes among leaders and teachers. The project was implemented in 10 districts (Gicumbi, Rulindo, Burera, Muhanga, Nyanza,<br>Nyamagabe, Gatsibo, Gasabo, Rubavu, Karongi) and 5 prisons (Muhanga, Nyanza, Gicumbi, Nyarugenge and Rubavu). Main activities involved implementation of Sociotherapy; coaching and provision of financial support to graduate groups; training of<br>local leaders and teachers on psychosocial reintegration of ex-prisoners and intergenerational legacies of the genocide; linking inmates and genocide survivors for truth sharing, apology, forgiveness and reconciliation and a mixed-methods research<br>to evaluate the effectiveness of Sociotherapy in improving mental welbbeing, social cohesion,reconciliation and economic empowerment."
    },
    {
        "title": "Magirirane Project",
        "image": "",
        "description": "Magirirane Project The project “Magirirane: A comprehensive journey towards healing, reconciliation and resilience in Rwanda, has been developed by a consortium of three organizations; CBS Rwanda as a lead organization, Institute for Community-based Sociotherapy<br>(ICBS), Tubibe Amahoro (TA) and financially supported the Delegation of the European Union to Rwanda. The project is implemented in Rwanda since September 2025 for a period of three years and half. The overall objective of the MAGIRIRANE project<br>is to “increase levels of societal healing and resilience in Rwandan communities, by facilitating communities to lead processes of psychosocial healing, reconciliation, reintegration and socio-economic empowerment”. The specific objectives are<br>as follow: Contribute to strengthening the psychosocial wellbeing of community members directly or indirectly affected by the genocide and facilitate a holistic rehabilitation and reintegration process among (former) inmates, improving family<br>and intergenerational dynamics, and foster inclusive socio-economic empowerment. Increase levels of ownership and sustainability of reconciliation processes at community level by bridging capacities of local and religious leaders and grassroots<br>initiatives at the intersection of MHPSS, reintegration and reconciliation. Enhance the national coordination and referral mechanism for MHPSS, reconciliation and reintegration initiatives. Implementation of CBS as an effective integrated MHPSS/PB<br>approach and lay the foundation for a regional scale-up. Economic development of CBS graduates through coaching, training, linking and provision of seed funding. Conduct research on societal issues in relation to MHPSS and peacebuilding and the<br>effectiveness of CBS through local knowledge and experience. The consortium will achieve the above-cited objectives through the implementation of the following main activities: Community based Sociotherapy (Mvura Nkuvure) in and outside prison<br>to provide a unique space for people to heal and re-establish social connections. Victim-offender and family mediation (Twegerane) Capacity bridging of local and religious leaders and grassroots initiatives on MHPSS, reconciliation and reintegration<br>of former prisoners. Tailor-made socio-economic empowerment activities. Digitalised stakeholder mapping platform and referral system: a digital mapping of actors and services working in the field of MHPSS, reconciliation and reintegration for<br>improved coordination and effectiveness of referrals through real-time information on service coverage and availability. Mixed-method research to evaluate project outcomes and for evidence-based advocacy."
    },
    {
        "title": "UBUMWE PROJECT",
        "image": "",
        "description": "UBUMWE PROJECT A two-year project implemented in partnership with Minisitry of National Unity and Civic Engagement (MINUBUMWE) between November 2022 and February 2025 with the aim to contribute to the improvement of societal healing, social cohesion and<br>community resilience. The project was implemented in three districts namely Karongi, Rubavu and Nyabihu. Main activities involved implementation of sociotherapy groups; awareness on mental health challenges, unity and community resilience; mapping<br>existing initiatives in societal healing, social cohesion, and community resilience; organize quarterly coordination meetings with stakeholders in societal healing and social cohesion; creating structures in charge of mental health at cell level<br>as well as identification and referral of people needing mental health and psychosocial support services"
    },
    {
        "title": "CONNECT FOR PEACE",
        "image": "",
        "description": "CONNECT FOR PEACE A 3 year project implemented by a consortium of the Institute for Community Based Sociotherapy; Rwanda; CBS Rwanda; EAR- Byumba Diocese, TPO Uganda, THARS Burundi to contribute to peace in communities in the Great Lakes region by implementing<br>and mainstreaming a locally -developed and locally-led integrated MHPSS/PB approach through the implementation of Sociotherapy as an effective integrated MHPSS and peacebuilding approach and lay the foundation for a regional scale-up; promotion of<br>economic development through coaching, training, linking and provision of seed funding; conducting research on societal issues in relation to MHPSS/PB and the effectiveness of Sociotherapy through local knowledge and experience an engaging with stakeholders<br>to mainstream the Sociotherapy approach in the great lakes region. CBS Rwanda implements this project since 2024 in five districts (Nyamasheke, Rwamagana, Gasabo, Rutsiro and Ruhango); three prisons (Rwamagana, Nyarugenge and Rubavu); and Universities<br>(University of Rwanda, Huye Campus and Kibogora Polytechnic)."
    },
    {
        "title": "EKN Project (Mvura Nkuvure — toggle content)",
        "image": "img/demos/cbs/projects/Grassroots-advocacy-1536x864.jpg",
        "description": "Funded by the Embassy of the Kingdom of the Netherlands, the “Mvura Nkuvure: Intergenerational healing and community reconciliation” project aims at dealing with the long-lasting consequences of the politically motivated ethnic discrimination and repression which repeatedly escalated into episodes of mass killings and eventually led to a well-orchestrated genocide against the Tutsi in Rwanda.<br><br>Community Based Sociotherapy Rwanda (CBS) and its project partners Anglican Church of Rwanda, Byumba Diocese and Prison fellowship Rwanda (PFR) have joined their efforts to specifically work on 1) facilitating the psychosocial reintegration of (ex-)prisoners, 2) addressing intergenerational legacies of the genocide that can be perceived as risk factors hampering reconciliation in the long term, and 3) the reinforcement of ownership among (local) leaders, teachers, other professionals who can be expected to make a difference in society. The three years project (2018-2021) works with people with different socio-historical backgrounds in local communities and schools in 9 districts (Muhanga, Nyamagabe, Nyanza, Rubavu, Gasabo, Karongi, Gicumbi, Burera and Rulindo) and in prisons (Muhanga, Huye, Nyarugenge, Rubavu and Gicumbi prison). Through the 250 well trained sociotherapists in both local communities and prisons, it is expected that the project will have more than 12,000 participants."
    },
    {
        "title": "Research in general Using Participatory Action Research (PAR)",
        "image": "img/demos/cbs/projects/P2121234-1536x1152.jpg",
        "description": "Participatory Action Research (PAR) Approach<br><br>CBS research uses a Participatory Action Research (PAR) approach. This method has as its two main goals the achievement of both action and research.<br><br>PAR is a very effective method as it constantly monitors the intervention. Simultaneously, the researcher has an active advisory role in the implementation and can suggest alternative strategies based on research observations while taking the specific context in which the intervention is applied into account.<br><br>Key Characteristics of PAR:<br>- Participative: All stakeholders are involved in the research, from the advisory committee to the sociotherapists at the grass roots level.<br>- Mixed Methods Research: The main focus lies on descriptions and on understanding social complexities via qualitative methods, while a general picture of the results will be generated through quantitative research. This combination of methods strengthens the qualitative data and provides a deeper understanding of the quantitative data.<br>- Reflective: Critical reflection on the intervention process and its outcomes are important features.<br>- Responsive: The researcher is able to respond to emerging difficulties during the implementation and immediately take action.<br>- Emergent and Cyclical: The process takes places gradually over a number of cycles so that interpretations of data can be tested, challenged, and refined.<br><br>Data Collection Tools:<br>- Semi-structured interviews<br>- Questionnaires/Surveys<br>- Focus Group Discussions<br>- Participant Observation<br>- Significant change stories"
    },
    {
        "title": "Tujyane Project",
        "image": "img/demos/cbs/projects/Group_session_CBS_Rwanda.jpeg",
        "description": "The Tujyane (let’s go together) project is funded by the European Union and aims at contributing to democratization processes and equitable development by supporting the reintegration process of ex-prisoners and mitigating the negative impacts of intergenerational legacies of the genocide, including the transmission of trauma, violence and divisionism. In this project, CBS is working together with the Dutch NGO Radio La Benevolencija and the project will be implemented in Nyabihu, Nyamasheke and Rusizi districts.<br><br>Sociotherapy group members from Bigogwe sector in Nyabihu district (image caption).<br><br>Introduction:<br>26 years after the 1994 genocide against the Tutsi in Rwanda ended, the impact of unaddressed trauma continues to influence the daily lives of many Rwandans. As the genocide took place at the community – and often very intimate – level, the social fabric within communities and families has been severely damaged. The trauma experienced continues to shape attitudes to reconciliation in the population. The reintegration and rehabilitation of the (soon to be) released prisoners into their families and communities threatens now to aggravate this intergenerational trauma and within the country’s reconciliation process.<br><br>To continue its efforts of contributing to psychosocial recovery from a history of violence and to promote sustainable peace across the generations, Community Based Sociotherapy Rwanda (CBS Rwanda) in partnership with the Dutch NGO Radio La Benevolencija (RLB), initiated a new project called the Tujyane.<br><br>Tujyane (“Let’s Go Together”) Project is a two-year project which is funded by the European Union and aims to contribute to democratization processes and equitable development by supporting the reintegration process of ex-prisoners and mitigating the negative impacts of intergenerational legacies of the genocide, including the transmission of trauma, violence and divisionism. The project will be implemented in Nyabihu, Nyamasheke and Rusizi districts.<br><br>In the Tujyane Project, community-based sociotherapy is used to enhance feelings of safety, trust and social dignity, and support processes of reconciliation, social cohesion and family and community conflict resolution. In addition to that, grassroots advocacy initiatives will be stimulated and facilitated through the People’s Parliament for Peace (PP4P) meetings. These approaches will be complemented by the national radio drama Musekeweya, developed and produced by RLB. Musekeweya seeks to make national populations recognize and resist stereotyping, hate speech, identity manipulation and incitement to violence. The drama will feature a special focus on the psychology of reintegration of ex-prisoners as well as the consequences of the intergenerational legacies of the genocide. The storyline and scripts will be adapted to the evolving context and input and feedback from the sociotherapy groups and radio listening clubs.<br><br>The overall objective of the project:<br>- To contribute to democratization processes and equitable development by supporting the reintegration process of ex-prisoners and mitigating the negative impacts of intergenerational legacies of the genocide, including the transmission of trauma, violence, and divisionism.<br><br>The specific objective of this project:<br>- To increase trust and acceptance within and between communities as well as the engagement of citizens and local leaders in reintegration processes at the grassroots level.<br><br>Expected outcomes:<br>- Increased sense of psychosocial well-being, self-efficacy and acceptance among ex-prisoners and other members of the selected communities.<br>- Increased citizen participation in community reintegration processes as well as engagement in grassroots advocacy.<br>- Increased knowledge and understanding of the effect of historical legacies on social cohesion and ability to recognize and resist divisive ideologies, incitement to violence and identity-based manipulation.<br><br>Together with national and local stakeholders, CBS Rwanda and RLB will combine approaches and efforts as organizations complementing one another."
    },
    {
        "title": "COSTAR Project",
        "image": "img/demos/cbs/projects/Gender-and-family-relations-1536x864.jpg",
        "description": "The Community-Based Sociotherapy Adapted for Refugees (COSTAR) project aims to evaluate the effectiveness of community-based sociotherapy (CBS) in reducing depressive symptomology in Congolese refugees. COSTAR is implemented in partnership with Liverpool University, the University of Rwanda, Makerere University (Uganda) and UNHCR. It is funded by the ESRC (Economic and Social Research Council).<br><br>The COSTAR project is a research project that aims to evaluate the effectiveness of community-based sociotherapy (CBS) in addressing psychosocial difficulties encountered by refugees and in particular to assess whether community-based sociotherapy reduces depressive symptomology in Congolese refugees. CBS Rwanda is in charge of coordinating the implementation of CBS approach. The project is implemented in Gihembe refugee camp in Rwanda where it targets Congolese Kinyarwanda speakers and in Kyangwali settlement in Uganda where it targets Congolese Swahili speakers. In Uganda CBS Rwanda partners with the Humanitarian Initiative Just Relief Aid (HIJRA). The University of Rwanda (UR) coordinates the research in Rwanda and Makerere University coordinates the research in Uganda; both universities are supervised by Liverpool University.<br><br>With adaptation of CBS to refugee context, it will be done the Randomized Controlled Trial (RCT), a health economic evaluation of the CBS delivery, process evaluation to enhance the replicability and generalizability of COSTAR, the implementation guidance, mentorship for clinical trial management and the development of knowledge exchange resources for evaluating interventions for refugees."
    },
    {
        "title": "Breaking cycles of violence",
        "image": "img/demos/cbs/projects/QqUjZlRX.jpeg",
        "description": "CBS Rwanda has been working as a partner of the Free University of Amsterdam (VU) in the Tailor-Made Training (TMT) project: Breaking cycles of violence: Strengthening the capacity of a local Congolese NGO in implementing, monitoring and evaluating community-based sociotherapy in North Kivu. This project has been implemented between 2018 and 2019 in the Democratic Republic of Congo. In this project VU and CBS worked together with the Congolese organization Africa Restoring Bridges Initiative (ARBI), based in North Kivu to strengthen its capacity in the domains of organizational development, monitoring and evaluation and to enlarge their expert pool of sociotherapy trainers. The project is funded by NUFFIC."
    },
    {
        "title": "Promoting community dialogue in the context of conflict",
        "image": "img/demos/cbs/projects/image.jpeg",
        "description": "The “Promoting community dialogue in the context of conflict” project is being implemented in South Kivu in the Democratic Republic of Congo. It is a Tailor-Made Training project funded by NUFFIC that runs from 2019 to 2020. In this particular project we work with the Congolese organization Paix et Développement Durable (PDD), an organization which is initiated by community-based sociotherapy facilitators. Our partner the Free University of Amsterdam (VU) provides trainings on organizational development and resource mobilization and CBS provides trainings on monitoring and evaluation and gender mainstreaming. In the project also sociotherapy facilitators are being trained to become sociotherapy trainers."
    },
    {
        "title": "Impacting hearts, heads and hands",
        "image": "img/demos/cbs/projects/image-1.jpeg",
        "description": "CBS Rwanda is also part of a partnership implementing the “Impacting hearts, heads and hands” project in Eastern Congo. It is a Tailor-Made-Training plus (TMT+) project that builds on the projects: Breaking cycles of violence and Promoting community dialogue in the context of conflict. It is funded by NUFFIC and next to CBS Rwanda, the Free University of Amsterdam (VU), African Restoring Bridges Initiative (ARBI) and Paix et Développement Durable (PDD) are partners. The project focuses on addressing intergenerational experiences of trauma and violence, promoting servant leadership and strengthening partnerships in the field of community-based-sociotherapy."
    },
    {
        "title": "Umusingi w’Amahoro Arambye: Breaking through intergenerational cycles of trauma and violence",
        "image": "img/demos/cbs/projects/vGNW6_kV-1536x864.jpeg",
        "description": "Ikiraro cy’Iterambere (Umusingi w’Amahoro Arambye)<br><br>Ikiraro cy’Iterambere has supported Community Based Sociotherapy (CBS), the Anglican Church, Byumba Diocese (E.A.R. Byumba) and Prison Fellowship Rwanda (PFR) on supporting reconciliation in local communities by implementing a project known as Umusingi w’Amahoro Arambye. The project focused on stimulating grassroots advocacy at the District level by working closely with sociotherapy groups in the districts of Muhanga and Rulindo.<br><br>In the People’s Parliaments for Peace (PP4P), representatives of the sociotherapy groups presented the issues the groups had observed in the communities to the local authorities together with recommendations to address the issues and the role the communities themselves can play. The approach used the experience of community engagement and trauma recovery to identify issues related to intergenerational transmission of genocide-linked trauma, including school truancy and youth drug abuse. This project run from October 2017 up to June 2018.<br><br>Reconciliation in action: Interrelating psychosocial support, reconciliation and economic development in post genocide Rwanda<br><br>The focus of this five-month project was on generating evidence on the linkages between psychosocial support, reconciliation and economic activities in post-conflict communities, like Rwanda. For this project, CBS and partners have developed a research design for the baseline, endline and follow-up study on the interrelation between psychosocial support, reconciliation and economic development.<br><br>CBS therefore resumed engagements with Sociotherapy groups supported in the first phase to develop bottom up indicators of the study areas (psychosocial wellbeing, reconciliation and economic development). In addition, 96 sociotherapists were trained in Nyabihu, Rulindo and Kamonyi to ensure the smooth and timely implementation of the longer-term project.<br><br>Facilitating unity and reconciliation processes through community-based sociotherapy<br><br>The “Facilitating unity and reconciliation processes through community-based sociotherapy project.” This six-month project was implemented between August 2019 and February 2020. The project has been implemented by a consortium of three organizations: Community Based Sociotherapy Rwanda (CBS Rwanda), Prison Fellowship Rwanda (PFR) and E.A.R. Byumba Diocese (EAR Byumba), in three different districts, respectively Nyabihu, Kamonyi and Rulindo.<br><br>A total of 48 sociotherapy groups have been running these three districts and after 15 sociotherapy sessions, they all started VSLA initiatives. In this project they were provided with a VSLA toolkit and a period of coaching by the field staff. In total 717 participants ended the 15 group sessions."
    }
]