[{
        "id": 6,
        "date": "May 30 2025",
        "title": "A Journey Back Home: Reintegration After Time in a Correctional Facility",
        "category": "therapy",
        "author": "CBS",
        "image": "img/gallery/6.jpeg",
        "excerpt": "Today marked the conclusion of an important 10-day ",
        "content": "<p>Today marked the conclusion of an important 10-day training designed to prepare 53 female inmates convicted for their involvement in the 1994 Genocide against the Tutsi for a successful return to society.</p><p>This program emphasized healing, rebuilding trust, and equipping participants with knowledge and tools to restore connections with their families and communities as they re-enter social life.</p><p>The event was attended by key representatives from national institutions and faith-based organizations, including Hon. Marie Alice Kayumba Uwera, Executive Director in Charge of National Unity and Community Resilience at the Ministry of National Unity and Civic Engagement (MINUBUMWE); Mr. Patrick Ufashingabo, Advisor to the Minister at the Ministry of Gender and Family Promotion (MIGEPROF); Priest Rutayisire from Butare Diocese; Senior Superintendent Olive Mukantabana representing Rwanda Correctional Service (RCS); and Beatrice, Director of Nyamagabe Correctional Facility.</p><p>Two main conversations marked the day. The first, led by MIGEPROF, focused on gender equality and equity. Participants engaged actively, asking questions that reflected their long absence from society and their desire to understand current legal and social frameworks.</p><p>The second conversation was delivered by Priest Rutayisire, who spoke on sin, redemption, and how to live peacefully with others. Quoting Scripture, he reminded them that the greatest commandment is love—for God, for others, and for oneself.</p><p>In her speech, Hon. Marie Alice Kayumba reflected on the purpose of the training. She emphasized the importance of understanding the impact of the Genocide against the Tutsi not only on the participants themselves, but also on their families, survivors, and the country.</p><p>She urged them to take active steps toward rebuilding social harmony by telling their families the truth about the crimes they committed, seeking forgiveness from those they harmed, and engaging in national development through community-based programs such as Umuganda, community assemblies, and social activities.</p><p>Some of the inmates were released on the same day. Their families were invited to attend the event to help them better understand their role in welcoming their relatives back and supporting them in rebuilding their lives.</p><p>At CBS, we remain committed to supporting the psychosocial wellbeing of individuals affected by a painful past and helping communities rebuild trust and resilience.</p>",
        "comments": 5
    },
    {
        "id": 7,
        "date": "20 Jan",
        "title": "Conviviality in CBS: A Celebration of Healing and Togetherness",
        "category": "therapy",
        "author": "CBS",
        "image": "img/gallery/1.jpeg",
        "excerpt": "Conviviality at CBS marks the completion of the 15-week Mvura Nkuvure sociotherapy journey, celebrating healing, transformation, and community togetherness.",
        "content": "<p>At its core, <strong>conviviality</strong> represents warmth, joy, and shared moments of connection. It is about coming together in an atmosphere of friendliness and celebration. At CBS, Conviviality embodies this spirit in a profound way—it is a special event that marks the completion of the 15-week <em>Mvura Nkuvure</em> sociotherapy process, where participants celebrate their journey of healing and transformation.</p><p><strong>What is Conviviality in CBS?</strong><br>In CBS, Conviviality is more than just an event; it is the culmination of shared experiences, personal growth, and strengthened bonds. It offers participants an opportunity to reflect on their healing journey, reconnect with their group, and embrace the transformation they have undergone. After 15 weeks of deep discussions, emotional breakthroughs, and mutual support, participants gather to honor their progress in a meaningful and joyful way.</p><p>Before reaching this celebration, participants go through an intentional healing process. CBS sociotherapists, working in pairs, engage communities to form groups of 15 individuals. These groups then embark on the <em>Mvura Nkuvure</em> experience—a name chosen by the community itself after witnessing the powerful impact of sociotherapy. Over the course of 15 weeks, participants share lived experiences, rebuild trust, and strengthen resilience, supported consistently by CBS staff and sociotherapists.</p><p>On Conviviality Day, participants embrace the moment with excitement and pride. Dressed in their best outfits, they create an atmosphere filled with warmth and joy. Each group chooses how to celebrate—some present sketches and poems, while others sing or dance. However, the highlight of the day remains the testimonies. These powerful stories of personal transformation leave a lasting impression on participants and invited guests alike, including CBS staff, community members, and local leaders.</p><p>The presence of local leaders is particularly meaningful, as it allows them to witness firsthand the impact of sociotherapy within their communities. Observing the transformation of participants reinforces the importance of such programs and encourages continued support for healing and reconciliation initiatives. These testimonies often shift perspectives and spread messages of hope and restoration.</p><p>True to the essence of conviviality, the celebration is marked by togetherness and sharing. Participants bring and share food and drinks, reinforcing values of unity and generosity. More than a simple gathering, this shared moment symbolizes their collective journey—one filled with struggles, breakthroughs, and ultimately, healing.</p><p>Beyond the celebration, Conviviality stands as a testament to the power of human connection. It demonstrates that when people come together in an atmosphere of trust and openness, healing becomes possible. Those who witness it often leave inspired, carrying renewed hope shaped by the resilience and courage of the participants.</p><p>At CBS, Conviviality is the embodiment of healing, joy, and the strength of community—a reminder that transformation is most powerful when it is shared.</p>",
        "comments": 0
    }



]
