[


    {
        "title": "The openness of others could drive me to anxiety",
        "content": "The openness of others could drive me to anxiety<br><br>Story by Pastor David Hakizimana<br>Hakizimana, a sociotherapist and pastor of a Pentecostal church of Rwanda (ADEPR), is passionate about sociotherapy, and wants the good news of community building to be known more widely.<br>From childhood, when he was orphaned and began to raise his younger siblings, and throughout his career as a pastor, Hakizimana has had people depending on him. He was still a child himself when he took care of his siblings, and as he’s grown up to become a community leader, those responsibilities have taken new forms. He sees himself as someone who is always solving others’ problems, but even as a member of the church, Hakizimana felt alone and couldn’t talk about his own feelings easily.<br>During the beginning of his role as a sociotherapist, the openness of others made Hakizimana nervous. In his line of work as a pastor, people shared stories with him, but only on a superficial level, not attaching emotions to their problems. In sociotherapy, participants were honest about their feelings. Hakizimana compares listening to others’ problems to being caught in a stream of bullets – because of how much history is shared in the community, he was afraid he would be shot down by an issue that affected him in a personal way.<br>But through sociotherapy, Hakizimana slowly began to rebuild himself and trust in others. He says there is a noticeable difference in his life; he has regained the relationships he lost in the past, and he no longer feels alone.<br>This development has even impacted his family life. He makes decisions for a big family of his own children and those of siblings, and since sociotherapy, Hakizimana has found new ways to resolve family conflict without harming those involved. He sits down with his family to talk through decisions, discussing the positives and negatives of possible outcomes, so family members feel involved and valued.<br>Because of his position in the church, the problem analysis that sociotherapy emphasizes has been valuable for advising community members in conflict.  Hakizimana doesn’t feel guilty anymore if he’s done all he can to solve a problem.<br>Most of all, Hakizimana feels that after solving others’ problems, he has space and time to unburden himself. In the group, he can shed his community titles and rest. When Hakizimana had to drop out of school to take care of his siblings, he felt shut out of opportunities. He wondered what his future would be like when support seemed scarce. Now, if Hakizimana could tell his childhood self one thing, he would say, “We’ve come a long way.”<br>Story written by Ann Gwin",
        "image": "img/storiesofchanges/9.jpg"
    },


    {
        "title": "I had no one to trust ",
        "content": "I had no one to trust<br>Story by Leoncie Kampire<br>Kampire, a sociotherapist from the Democratic Republic of Congo (DRC), supports a number of people every day in Gihembe Refugee Camp.<br>Even with these relationships, Kampire felt weighed down by her problems. Insomnia kept her up at night, she would burst into tears over small things, and sometimes spent days in bed, feeling that there was no one with whom she could share her feelings.<br>The hardest part of sociotherapy was finding the trust to share her burdens. Even though Kampire had gone through sociotherapist training, opening up didn’t come naturally at first. Six weeks into the session Kampire was facilitating, another woman shared about her experiences growing up as an orphan. As an orphan herself, Kampire was deeply affected by hearing another person’s experience which was so similar to her own. She tried to maintain her role as sociotherapist by restraining her emotions, but developed a terrible headache during the session, and sobbed once she got home.<br>However, over the course of sociotherapy, she’s learned to trust others with her burdens and in turn listen attentively. She no longer takes sides in a conflict based on which person she likes better, but tries to understand both sides of the story so she can mediate well.<br>This has also allowed her to be more gracious to people she doesn’t get along with. For instance, a widow in her neighborhood seemed to be singularly focused on disturbing Kampire’s life, which was frustrating. Now, Kampire recognizes the difficulty of being a widow in a refugee camp, and understands that the neighbor’s aggravation is probably a result of the adversity of her circumstances, which makes being patient easier. If Kampire could tell her younger self one thing, it would be to not keep things to herself. “There are bad people in life, but there are also good people”, Kampire says, and “most of the time I’ve gotten something good, it’s come from someone else’s hands.”<br>A story written by Anna Gwin",
        "image": "img/storiesofchanges/8.jpg"
    },


    {
        "title": "I found contentment in Mvura Nkuvure and I was able to open up ",
        "content": "I found contentment in Mvura Nkuvure and I was able to open up<br>Story of change by Venantie Mukamana<br>My name is Venantie. My independent life began when I moved to Kigali for work as a young adult. I couldn’t work on my family’s farm due to stomach issues, so I decided to get a job in the city. After a short time, though, I got pregnant, and when I came back to my hometown, my family chased me away.<br>I then moved to this village, Kabgayi. I was still looking for work, but no one would hire me. I think there are two reasons behind this – 1) I was physically weak from lack of food and the stress of trying to provide for my child as a single mother, 2) I was quiet and closed off. I felt so isolated, I couldn’t talk – I was just silent all the time. I had no sense of connection to anyone in the village, and I couldn’t love anyone. I felt like dying would be better than living.<br>When I first joined sociotherapy, I still didn’t talk. It took a long time to open up to the group, but once I felt comfortable, I started talking again. This also helped me find work and alleviated some of my stress.<br>Though I now have two children living with me and sometimes it’s difficult to come be with the group, or even find work, I’m happy to be connected to others and be able to share my life.<br>The Mvura Nkuvure sociotherapy sessions have now finished and I’m happy that our graduate group has continued meeting as a handicraft co-operative. I was also overjoyed to be voted secretary of the co-operative, because it means the group trusts me.<br>During the coronavirus pandemic, it’s been difficult to find work and get food, but I have a group to support me. I feel kubohoka – relieved of isolation.<br>Venantie Mukamana<br>A story written by Anna Gwin",
        "image": "img/storiesofchanges/7.jpeg"
    },




    {
        "title": "Without Mvura Nkuvure, I think I would have gone mad ",
        "content": "Without Mvura Nkuvure, I think I would have gone mad<br>Story of change by Betty Niyonsaba<br>My name is Betty. I was born in 1990, and I lost my parents during the genocide when I was four. My maternal grandmother took me in, but she mistreated me and my siblings. Though we were financially supported by FARG (Genocide Survivors Assistance Fund), our needs were greater than the monthly stipend and my grandmother didn’t feed us. I had to beg from the other people in the village and they called me a ‘mad girl’.<br>I started school at age eight. Because my younger brother was already in P1 and the teachers didn’t want us in the same class, I went straight into P2. Taking care of my siblings affected my education, and I became frustrated and angry with the people who killed my family and put me in this situation. Despite these challenges, I got a scholarship to start university.<br>Once I got to university though, I quickly realized how I was different from other students. I only had one dress and felt ashamed to wear the same thing every day, but I didn’t have money for more clothes. There was a boy who was interested in me, so I married him because I thought he could support me.<br>Married life was only harder. I had a child in our first year of marriage, and now instead of only feeding myself, I had to find food for my husband and baby too. To complicate matters, my mother-in-law couldn’t stay in her own house. She was so traumatized by the killing of her husband during the genocide that staying in that same house alone was unbearable. When her son moved out of the house to live with me, she had trouble staying inside and began sleeping in the yard, so we let her move in with us right away.<br>Without Mvura Nkuvure, I think I would have gone mad. Before I started going, others tried to discourage me. They said there were no tangible results to sociotherapy – no money or food – but I went because I wanted peace. Initially, it was intimidating because everyone was older than me, and I underestimated myself. I often underestimate myself, because it’s hard to be confident when most people tell you you’re not going to succeed. But through sociotherapy, I gained peace and friends. My heart is open and I can approach others for help. I enjoy the games we play as a group, especially football. I still play football whenever I get the chance. My sociotherapy group has finished the Mvura Nkuvure sessions, and we decided to start a co-operative so that we can stay together. Though COVID-19 has put it on hold, the co-operative generally meets once a week and everyone contributes to the group financial fund that members can borrow from, then we work on handicrafts.<br>A story written by Anna Gwin ",
        "image": "img/storiesofchanges/6.jpeg"
    },




    {

        "title": "My willingness to forgive was stimulated by the phase of trust ",
        "content": "My willingness to forgive was stimulated by the phase of trust<br>Story of Change­: Théoneste Bazatsinda<br>During the genocide, we lost six members of my family. Though we received Gacaca court services, I wasn’t satisfied because they didn’t give survivors enough time to express ourselves, and the trauma from the genocide has remained with me.<br>I joined the third round of sociotherapy in Rutunga Sector and after joining, I realized every single member of our therapy group had social problems and unresolved conflicts. When we started the real, core part of Mvura Nkuvure, these deep issues became our focus.<br>In my sociotherapy group, I had long-term conflict with three people, who were a few of the perpetrators who came to kill my family during the genocide. One of them was my closest neighbor, who lived within 5 miles of me, but we still couldn’t talk to each other. In sociotherapy, we sat in different parts of the circle to put distance between ourselves.<br>Then, beginning phase 4 of sociotherapy, the sociotherapists introduced some icebreakers for the group to ease us into trusting one another. During this activity, we got into a place where we could express ourselves without realizing it. I began feeling it was possible to be on the same level as the others, even my offenders.<br>Because of this, I decided to approach others for reconciliation, starting with the three people whom I had conflict with in my sociotherapy group. They were open to a meeting, and one had already requested facilitation from the sociotherapists, who assigned the reconciliation meeting as ‘sociotherapy homework’. Sociotherapy was like the soccer pitch set up for a game – the sociotherapists had given us a ball, and now we could come onto the field.<br>We chose a date and set up a meeting at my house, with my wife and two sisters present. My sisters, who had also survived the genocide, were reluctant to join in. They knew that speaking with the perpetrators would force them to relive traumatic memories of the genocide. Thanks to sociotherapy, I was mentally prepared for interacting with my offenders, and I explained the lessons of sociotherapy to my sisters to convince them that the exchange was necessary.<br>The evening the perpetrators came over, we only had time for one man to speak, because it took a long time for him to tell his story. It was painful to listen to him recounting every detail of how he had helped kill my family, but we did it so that we could understand what had happened, and what he had done. He was intent on confessing and begging pardon for his actions, because he felt that he was a different person than he was before. I forgave him that night.<br>The others came back the following day, and the next man told the same story, but was even more earnest to reconcile. Apparently, he had been trying for a long time to find a way to reach out to me. The last woman who came to reconcile didn’t participate directly, but her father was one of the chief perpetrators who organized the killing, and she felt the need to seek forgiveness on her family’s behalf. These two people were even easier to forgive than the first.<br>The following session, we reported to the larger therapy group how we had reconciled. Hearing about this prompted two more people in the group to come to me for reconciliation.<br>Because of Mvura Nkuvure, I was mentally prepared to receive a woman whose husband was a key perpetrator against my family. He participated in the genocide, and after killing my brother, this man immediately took my brother’s clothes and shoes and started wearing them. He was charged with dehumanizing my brother’s body and sentenced to 30 years in prison. Recently, his wife joined a sociotherapy group and decided to come forward to reconcile with me. I’ve made peace with her, and once COVID-19 restrictions are over, I’ve committed to go with her to visit her husband in prison.<br>Though before this we couldn’t sit next to each other, I and the past offenders walking home together from group sessions, visiting each others’ houses, and even giving each other a hand with the farming. Now, I feel like I can call on my neighbors when I need help.<br>To my past offenders, I would like to say, “Feel free. Feel at home. I’m your brother. You’re my brother.”<br>Through sociotherapy, “you get released. You no longer have a burden on your heart.”<br>A story written by Anna Gwin",
        "image": "img/storiesofchanges/5.jpeg"
    },

    {
        "title": "I was not expecting much from my surroundings, but Mvura Nkuvure has provided more than expected",
        "content": "I was not expecting much from my surroundings, but Mvura Nkuvure has provided more than expected<br>After driving for one hour, from Rubengera, through the mountains of Karongi on the shaky cobblestone road, we reached Murambi sector where sociotherapists and 14 sociotherapy participants had invited us to join their conviviality meeting.<br>Conviviality meetings are normally organized at the end of every round of Mvura Nkuvure at community level, as an event marking the official closure of the 15 sociotherapy sessions. It is considered to be a grassroots platform that gives participants the opportunity to tell their stories and their experiences gained through the interaction in the sociotherapy group. It is also a celebration, as the participants do not only share stories but they also share some food and sing and dance together.<br>Sociotherapists from Murambi sector presided over conviviality meeting that brought together 14 sociotherapy group members who had been attending Mvura Nkuvure sessions for 15 weeks. The group members who concluded this round were recruited in May 2019 and selected – in close collaboration with local leaders – from genocide survivors and perpetrators in Mubuga cell.<br>This conviviality meeting was attended by sociotherapy graduates, their family members and local leaders. During the meeting, the graduates expressed their feelings vis-à-vis their experience and what they have gained from Mvura Nkuvure. The testimonies were touching and revealed that the participants experienced a different life after attending the group than before attending Mvura Nkuvure. One testimony in particular was highlighting that the group led to behavioral change.<br>This was not only mentioned by sociotherapy graduates but also their family members witnessed that the life before joining Mvura Nkuvure program is different from the life they are living after attending this program.<br>“…The first thing I could feel before joining this Mvura Nkuvure program, was fear; I was desperate, and hesitant, I didn’t know how I would meet and sit together with the genocide survivors…”<br>Extract from the testimony of one of the sociotherapy graduates – a genocide perpetrator – who confessed his involvement in the 1994 Tutsi Genocide, and served his sentence doing the community work, popularly known as TIG (travel d’interest generale).. During the time he spent out of his home, serving his sentence, he could receive communications informing him that his wife had another husband. This made his life miserably bitter all through the reintegration process after completing his sentence<br>“That was the most terrible experience I ever had in my life” he said, adding that he used to feel insecure in his own family and even in the rest of his community members whom he had wronged.<br>“I was in the most horrible situation that no one could understand or find a way out. I was not expecting my extended family to help me out, neither competent institutions nor local authorities. I was in a complete isolation, […] until I got a chance to participate in Mvura Nkuvure”. He mentioned that the sociotherapy phases of “Safety” and “New life orientation” helped him to understand that interacting with a person that one maltreated, can help to reduce fear to ask for forgiveness and at the same time paves way for possible feelings of forgiveness. “[….] certainly Mvura Nkuvure has provided me with moral and social support more than expected that no one else would be able to do from my neighborhood… I’m now satisfied with peaceful and positive mind and my wife is the eyewitness” he concluded.<br>According to the local aleaders of Murambi sector, Mvura Nkuvure is contributing a lot in promoting unity and reconciliation at community level. It is expected that the sociotherapy graduates in Murambi sector will support the execution of Ndi Umunyarwanda/Imihigo relatedactivities effectively. And in addition to that, the sector leaders expect to close the pending 80 Gacaca cases thanks to the support of these sociotherapy graduates. Murambi, in this event, sector was represented by the chairman of executive committee and the Civil Registrar.<br>“You are not concluding, you are rather starting… this is the begging of unity and reconcilitation journey” said by Emmanuel NIYIBIZI, the Murambi Civil Registrar, emphasing the role that Mvura Nkuvure plays in sustaining social cohesion in Murambi; he further added that the sociotherapy graduates are going to be the promotersof unity, reconciliation and sustainable peace which will benefit 23,227 citizens of this sector. The graduates will be meeting on regular basis with the sector leaders to plan and coordinate related activities. ",
        "image": "img/storiesofchanges/4.jpeg"
    },

    {
        "title": "I wanted to apologize but didn’t know how",
        "content": "I wanted to apologize but didn’t know how<br>My name is Francois. I was born in 1964 in Muhanga district. I am married and a father of two children. Before the genocide, I was a farmer.. Although I participated in the genocide, I never truly had the intention inside my heart to do so.<br>When the genocide started, I initially tried to save Tutsis by hiding them. However, one day perpetrators found out about this. I was escorting the persons I hid in my house to Kabgayi, so that they could find better refuge there. On our way I was caught by Interahamwe. They called me a traitor because I had sheltered those snakes in my house. They almost beat me to death and took my money. The men claimed the money was not enough, and forced me to kill an inyenzi (cockroach) and bring inkuracyobo.1 The person I had to kill was my nephew, who was born out of a mixed marriage. One of the Interahamwe men obliged me to use drugs. After I had done so I went to my nephew to kill him. I beat him with a club and when he was almost dead I obliged him to give me inkuracyobo.<br>Later the Interahamwe men and I spent the money on drinking beer. This day formed my initiation into the group of killers. I became like an animal; I stole people’s properties and ate their cows, and I always carried a club and a machete with me. Whenever I was back home, my consciousness was not at peace. However, I was not able to stop doing with what I started.<br>One day we received the news that RPF soldiers were taking over the country. Many people – including myself – deserted the Interahamwe. We took refuge at Nyange. After a couple of days the RPF soldiers reached this place. They told us to go home and resume our normal activities. As such, I went back home and resumed my farming activities. For approximately six months I cultivated and harvested my land, just as I had done before the genocide. However, one day the district office informed me that I was arrested and brought me to the sector’s dungeon.<br>In July 1995 I was taken to the provincial prison. Already in the dungeon I had come to realize that the persons I had killed had died for nothing. In prison I reflected on the reason behind my imprisonment again. I came back to my full senses and regained my humanity. I started to repent and recognize my sins. I also started to ask for forgiveness and mercy from God. After some time, many religious leaders visited me and my fellow inmates and emphasized that our punishments would be reduced if we accepted our past wrongdoings and repented. This soothed us and encouraged us even more to repent and ask for forgiveness. I took the decision to patiently endure the hardships I was going through, to respect every human being, and to avoid from then onwards anything that could take me back into prison. When the Gacaca courts started, I acknowledged my past wrongdoings in public and I was sentenced. However, someone accused me of a crime that I had not committed. The Gacaca judges were not convinced by my denial and sentenced me to 19 years imprisonment. I was released from prison on 6 June 2014.<br><br>After my release, I tried to live and cooperate with everyone. I found out that the people whom I had tried to save during the genocide were still alive. They welcomed me with joy. Before the genocide, the relationship between our families had been good. Therefore, these persons encouraged me and tried to reintegrate me into society. However, I was afraid of the person that I had tried to kill or whose family members I had killed. I wondered how I could ever face my nephew again. I did not feel comfortable meeting him, and I had no idea how we could reconcile easily. I wanted to apologize, but I did not know how.<br>When I was recruited into sociotherapy, I was very reserved at first, and did not to share my feelings or thoughts. However, as I observed others progressively sharing their experiences, I started to open up. I managed to share my life experiences, which led to different reactions. Whereas some participants did not take it seriously and suggested I could be imprisoned again, others benefited a lot from it. They told me I was really courageous to share such an experience. This made me feel very peaceful and relaxed. The sociotherapists suggested to me to meet my nephew and his family, so I could apologize and we could reconcile. As sociotherapy had strengthened me, I agreed and one day I went to meet my family members.<br>When I visited them, I acknowledged that I had behaved like an animal during the genocide. I emphasized that gradually I had become aware of the heaviness of my deeds. I received a lot of support from people during that reconciliation ceremony, which impressed me much. What I experienced that day freed me a lot from the burden I was carrying because of my past wrongdoings. After that, I decided to make people understand how much I benefited from the forgiveness of my nephew and his close family. I do not know how I can contribute to my nephew’s life that I have damaged so severely, but I want to show him how sincere my gratitude is. I am so thankful for sociotherapy to have supported me in reintegrating myself into my family. Also, my neighbors, friends and family supported me during my religious wedding. It illustrated that they trust me again and that they want to reestablish the good relationship we had before the genocide. ",
        "image": "img/storiesofchanges/3.jpg"
    },

    {
        "title": "I regained hope",
        "content": "My name is Elina. I am a widow and mother of 3 children. I was born in 1977 in Gatsibo district, but I grew up in Rulindo district with my mother.<br>I remember one particular Thursday in April 1994. My mother woke up early to go to Kigali to sell vegetables. However, this time she could not reach Kigali as the genocide had already started. She returned, only reaching home in the evening hours. There had been many barriers on the main road, which forced her to travel through different rural paths.<br>That same evening houses were burnt. When the Interahamwe entered our village a couple of days later, we fled our home. In that disorder I lost my family and only remained with my cousin. We hid in a sorghum plantation near our house, but my cousin was killed the following day. After three days of hiding, I got hungry and went to beg for food at a house nearby. The woman gave me something to eat, but told me to go away as her sons could kill me. A few minutes later her sons entered the house. I ran away, but they managed to catch me. They did not kill me directly, but hid me in a house that was under construction. The older of the two regularly brought me food. Three days later he was accompanied by a couple of men. After I finished eating, they raped me. Next, some of them beat me and others pressed their fingernails in my face and in my genitals. They left me there to die. When I regained my consciousness, I could not stand up nor walk. I crept around like a snake. A man that found me after four days gave me water, a sweet potato, and some traditional medicines. Still, I was in much pain. I was also very depressed. I exposed myself to the killers in the hope that they would kill me, but they did not.<br>I decided to go back to my house, only to find it destroyed. From then on, I spent a long time hiding in sorghum plantations, begging for food, and regularly fleeing to different places. When the war started in Shyorongi, I went out of hiding to see what was going on. I met a man who hid me in his house, but who forbid me to expose myself to the outside world. As I was still threatened with death several times, I decided to flee to Congo. The way was very long, miserable and tiring, and I faced hunger, sickness and rain. When I finally arrived in Mugunga camp I thought I was safe. However, even in this camp I found myself brutalized by people, who claimed I looked like an inyenzi (cockroach). Some of them tried to kill me, including the chief of the orphanage where I stayed for a couple of months. One day I met my cousin in the camp, and went to live with her and my aunt. I was very happy to finally have found a safe place to stay. However, as we lived in poverty we decided to return to my aunt’s house in Kigali. In Kigali I soon enrolled in school. After a while I married with my neighbor. I never shared my life experience with him, because I did not know how. In 2004 my husband was diagnosed with tuberculosis and HIV/AIDS. He died a few days later. I myself also turned out to be HIV/AIDS positive. It was then that I realized that one of the men who had raped me in 1994 was HIV/AIDS positive; I had retrieved that information when I was collecting information for the Gacaca courts. Knowing that I was HIV/AIDS positive was a heavy burden for me, but I continued to struggle with my three children. After a while, the Genocide Survivors Assistance Fund (FARG) informed me they had rebuilt my house in Shyorongi. When I returned there, it turned out that my aunt had sold all the surrounding fields. This made me very poor, isolated, irritated, and deeply angered. I did not have any interest of life anymore.<br>In this situation, a sociotherapist came to my home to invite me for participation in sociotherapy. As she was my friend I did not hesitate to join her. The first sociotherapy session was useless to me. I did not trust anybody. I was constantly wondering what I would, and would not, share with the other participants. I decided for myself that I would continue participating in the sessions, but only by listening to the others. After building safety and trust however, I shared my life experience with the group. From that day, I felt like a different person. My brain relaxed, and I regained empathy and love for people.<br>I benefited a lot from sociotherapy. Although I had received psychological support from FARG, it was not enough to heal my wounds. Sociotherapy helped rebuilding my self-esteem. It improved the way I took care of myself as a person who is HIV/AIDS positive. Sociotherapy provided me a space to express emotions and listen to others who faced different distresses. Hearing such heavy stories of others made me realize I am not the only one who suffered. Now I believe that my future will be bright because I have many true friends around, my children are growing up and I do not feel ashamed anymore of being HIV/AIDS positive. I am thankful of this program because it changed my life. It gave me friends who support me and take care of me when I get physically weak. I do not fear the future anymore.",
        "image": "img/storiesofchanges/2.jpg"
    },



    {
        "title": "Sociotherapy made me understand how others suffer because of my father’s crimes",
        "content": "My name is Issa. I was born in 1997. Together with my mother and my three siblings I live in Rubavu district. During the genocide, my father killed people and looted their property. A couple of years later, my family went to a refugee camp in Congo.<br> I never really knew why. <br>The conditions in the camp were very bad; we lived in extreme poverty and hunger. When my father died of diarrhea in 1998, my mother took me and my siblings back to Rwanda. As the security situation in Rubavu was still volatile, we first went to Rulindo district for five years.<br> We still lived in poverty. In 2003 we went back to our home in Rubavu. In that same period the Gacaca courts started. My mother was accused of refusing to repair property that had been destroyed by my father during the 1994 genocide. She tried her best to repair some of it. She had to sell almost all our land, forest and cows in order to get money for reparation. I was never aware of the situation my family was in. <p>I only sensed that life was becoming worse; from then on my mother was barely able to feed us or to pay for our school fees. <br>It was in 2012 that I discovered the reason behind our poverty. One day, I heard my mother and my aunt arguing. At a certain moment my aunt screamed: “You will never be rich, as you will continue to pay back all that your husband had destroyed!” I asked my mother about this insult, but my mother never disclosed the crimes of my father. Therefore, I contacted my aunt. She told me about the genocide, and about the wrongdoings of my father for which my mother now had to pay. I was shocked when I heard this. All of a sudden it became clear why we had been exiled in Congo, and why we lived in poverty. I came to understand why children at school and in the community had been stigmatizing me. They never wanted to play with me or collaborate with me in youth activities, telling me that I was the son of a genocide perpetrator. It was neither a mystery anymore why my mother did not have good relationships with our neighbors and community members.<br> Knowing that I was the son of a genocide perpetrator affected me a lot. As a result, I dropped out of school. I felt dissatisfied and life became meaningless to me. I could not sleep. I spent days and nights wondering why the crimes of my father were affecting the whole family. I asked my mother numerous times why my father had killed people during the genocide, and why he had damaged their property. My mother never revealed the truth. I felt a great anger towards my father, but also to the persons stigmatizing me and my family. I could not interact with my peers, because I was ashamed. I started to drink alcohol and to smoke tobacco, but I could not comfort myself. I was very isolated. It was then that I was invited into sociotherapy. The socio-group consisted of young people from different backgrounds. There were descendants of genocide survivors and of ex-prisoners, orphans, and children whose fathers are still in a refugee camp abroad. Initially, I was very quiet and scared. I did not interact with anyone, and I expressed my feelings or ideas. I just listened carefully to the stories of the other participants. It made me understand that I was not the only one who was wounded. I eventually shared my story with the group, and I revealed that I planned to take revenge on the people that my mother had to pay, and on the children that stigmatized me at school. Those were the ones that had made my life so tough. My fellow sociotherapy participants shared their ideas and advice on how to deal with the challenges I encountered. I apologized to my group members for my bad mindset. I decided to stop using alcohol and drugs. I also stopped misbehaving, and I banned the thoughts about taking revenge from my mind. Before sociotherapy, I felt inhuman and I hated the people who had witnessed my father’s crimes. Sociotherapy made me see how others are still suffering from my father’s wrongdoings. Today, I have a good relationship with people of my age and with my neighbors. Though we are still poor, I am committed to work and to assist my mother and my siblings in order to improve our economic situation. At this moment I am taking vocational trainings so I can become a mechanic or electrician. I am very grateful to sociotherapy for changing my life. I feel safe and manage to sleep again. I now have hope of a brighter future.",
        "image": "img/storiesofchanges/1.jpg"
    }
]